Repository: Zayrick/UniLLMs
Catalog: UniLLMs/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# settings.section.capabilities
source: Capabilities
zh_hans: 能力

# settings.section.configuration
source: Configuration
zh_hans: 配置

# settings.section.general
source: General
zh_hans: 通用

# settings.section.model_and_conversation
source: Model & Conversation
zh_hans: 模型与对话

# system_prompts.add_prompt
source: Add Prompt
zh_hans: 添加提示词

# system_prompts.choose_prompt
source: Choose Prompt
zh_hans: 选择提示词

# system_prompts.count.format
source: %ld custom prompts
zh_hans: %ld 个提示词

# system_prompts.count.none
source: No custom prompts
zh_hans: 暂无自定义提示词

# system_prompts.count.one
source: 1 custom prompt
zh_hans: 1 个提示词

# system_prompts.custom.title
source: Custom Prompts
zh_hans: 自定义提示词

# system_prompts.empty.manage.detail
source: Create a prompt to reuse in chats.
zh_hans: 创建后可在对话中复用。

# system_prompts.empty.select.detail
source: Create prompts from Settings.
zh_hans: 请在设置中创建提示词。

# system_prompts.empty.title
source: No System Prompts
zh_hans: 暂无系统提示词

# system_prompts.name.placeholder
source: Translation Assistant
zh_hans: 翻译助手

# system_prompts.new_prompt
source: New System Prompt
zh_hans: 新系统提示词

# system_prompts.prompt
source: Prompt
zh_hans: 提示词

# system_prompts.prompt.footer
source: Applies to chats that use this prompt.
zh_hans: 适用于使用该提示词的对话。

# system_prompts.prompt.placeholder
source: You are a concise assistant.
zh_hans: 你是一个回答简洁的助手。

# system_prompts.settings.footer.automatic_context
source: Added to each request so replies can use them when relevant. Note: Dynamic items like time or memory can reduce prompt cache hits and increase API costs.
zh_hans: 这些内容会随每次请求附加，供回答按需参考。 注意：时间、记忆等动态内容可能降低缓存命中率，增加调用成本。

# system_prompts.settings.row.current_date.detail
source: Let replies know the current date and time.
zh_hans: 提供当前日期和时间。

# system_prompts.settings.row.current_date.title
source: Current Time
zh_hans: 当前时间

# system_prompts.settings.row.memory.detail
source: Let replies reference saved preferences and details.
zh_hans: 提供已保存的偏好和信息。

# system_prompts.settings.row.memory.title
source: Memory
zh_hans: 记忆

# system_prompts.settings.section.automatic_context
source: Auto Include
zh_hans: 自动附加

# system_prompts.settings.section.custom_prompts
source: Custom Prompts
zh_hans: 自定义提示词

# system_prompts.settings.section.memory_context
source: Memory Include Settings
zh_hans: 记忆设置

# system_prompts.untitled_prompt
source: Untitled Prompt
zh_hans: 未命名提示词

# tools.calendar_tools
source: Calendar Tools
zh_hans: 日历工具

# tools.calendar_tools.detail
source: Choose which calendar actions are available.
zh_hans: 选择可用的日历操作。

# tools.calendar_tools.list
source: Calendar Tools List
zh_hans: 日历工具列表

# tools.calendar.create.name
source: Create Calendar Event
zh_hans: 创建日历事件

# tools.calendar.create.summary
source: Create a calendar event when the user asks.
zh_hans: 按用户要求创建日历事件。

# tools.calendar.delete.name
source: Delete Calendar Event
zh_hans: 删除日历事件

# tools.calendar.delete.summary
source: Delete a calendar event when the user asks.
zh_hans: 按用户要求删除日历事件。

# tools.calendar.error.access_restricted
source: Calendar access is restricted on this device.
zh_hans: 此设备上的日历访问受限。

# tools.calendar.error.empty_argument_format
source: %@ cannot be empty.
zh_hans: %@ 不能为空。

# tools.calendar.error.full_access_denied
source: Calendar full access is required to read, update, or delete events. Enable it in Settings.
zh_hans: 读取、更新或删除事件需要完整日历访问权限。请在设置中启用。

# tools.calendar.error.invalid_bool_format
source: %@ must be true or false.
zh_hans: %@ 必须为 true 或 false。

# tools.calendar.error.invalid_date_format
source: %@ must be an ISO 8601 date or date-time.
zh_hans: %@ 必须是 ISO 8601 日期或日期时间。

# tools.calendar.error.invalid_date_range
source: end_date must be after start_date.
zh_hans: end_date 必须晚于 start_date。

# tools.calendar.error.invalid_integer_format
source: %@ must be an integer from 1 to %ld.
zh_hans: %@ 必须是 1 到 %ld 的整数。

# tools.calendar.error.invalid_url_format
source: %@ must be a valid URL.
zh_hans: %@ 必须是有效 URL。

# tools.calendar.error.missing_argument_format
source: %@ is required.
zh_hans: 缺少 %@。

# tools.calendar.error.missing_event_format
source: Calendar event is not available: %@
zh_hans: 日历事件不可用：%@

# tools.calendar.error.no_update_fields
source: Provide at least one field to update.
zh_hans: 请至少提供一个要更新的字段。

# tools.calendar.error.write_access_denied
source: Calendar write access is required to create events. Enable it in Settings.
zh_hans: 创建事件需要日历写入权限。请在设置中启用。

# tools.calendar.read.name
source: Read Calendar Events
zh_hans: 读取日历事件

# tools.calendar.read.summary
source: Read calendar events in a date range when the user asks.
zh_hans: 按用户要求读取指定日期范围内的日历事件。

# tools.calendar.update.name
source: Update Calendar Event
zh_hans: 更新日历事件

# tools.calendar.update.summary
source: Update a calendar event when the user asks.
zh_hans: 按用户要求更新日历事件。

# tools.current_datetime.name
source: Current Date and Time
zh_hans: 当前日期和时间

# tools.current_datetime.summary
source: Returns the current local date and time.
zh_hans: 返回当前本地日期和时间。

# tools.enable_tools
source: Enable Tools
zh_hans: 启用工具

# tools.enabled_count_format
source: %ld/%ld enabled
zh_hans: 已启用 %1$ld/%2$ld

# tools.error.missing_tool_format
source: Tool is not available: %@
zh_hans: 工具不可用：%@

# tools.footer.no_built_in
source: No built-in tools.
zh_hans: 暂无内置工具。

# tools.footer.no_mcp_servers
source: No MCP servers.
zh_hans: 暂无 MCP 服务器。

# tools.memory_tools
source: Memory Tools
zh_hans: 记忆工具

# tools.memory_tools.detail
source: Choose which memory actions are available.
zh_hans: 选择可用的记忆操作。

# tools.memory_tools.list
source: Memory Tools List
zh_hans: 记忆工具列表

# tools.memory.delete.action
source: Delete memories
zh_hans: 删除记忆

# tools.memory.delete.name
source: Delete Memory
zh_hans: 删除记忆

# tools.memory.delete.summary
source: Delete a saved memory when the user asks.
zh_hans: 按用户要求删除记忆。

# tools.memory.find.action
source: Find memories
zh_hans: 查找记忆

# tools.memory.find.name
source: Find Memories
zh_hans: 查找记忆

# tools.memory.find.summary
source: Find saved memories that may help answer the user.
zh_hans: 查找可帮助回答的记忆。

# tools.memory.save.action
source: Save memories
zh_hans: 保存记忆

# tools.memory.save.name
source: Save Memory
zh_hans: 保存记忆

# tools.memory.save.summary
source: Save a detail the user wants the assistant to remember.
zh_hans: 保存用户希望助手记住的内容。

# tools.memory.update.action
source: Update memories
zh_hans: 更新记忆

# tools.memory.update.name
source: Update Memory
zh_hans: 更新记忆

# tools.memory.update.summary
source: Update a saved memory when the user asks.
zh_hans: 按用户要求更新记忆。

# tools.memory.view.action
source: View memories
zh_hans: 查看记忆

# tools.memory.view.name
source: View Memories
zh_hans: 查看记忆

# tools.memory.view.summary
source: Show saved memories so the assistant can use or manage them.
zh_hans: 显示记忆，供助手使用或管理。

# tools.section.built_in
source: Built-In
zh_hans: 内置

# tools.section.calendar
source: Calendar
zh_hans: 日历

# tools.section.memory
source: Memory
zh_hans: 记忆

# tools.section.system
source: System
zh_hans: 系统
